update docs diagrams to use mermaid
